In [12]:
import pandas as pd

In [17]:
data = {
    "Ename" : ['roshan','amar','ashwini','lohith','mohan','pramod'],
    "Type" : ['Regular','Adhoc','Regular','Adhoc','Contract','Regular'],
    "Department" : ['CS','CS','EC','EC','CS','EC'],
    "Experienc" : [10,20,4,14,9,8],
    "Salary" : [50000,15000,30000,15000,10000,40000]
}
df=pd.DataFrame(data)
df

     Ename      Type Department  Experienc  Salary
0   roshan   Regular         CS         10   50000
1     amar     Adhoc         CS         20   15000
2  ashwini   Regular         EC          4   30000
3   lohith     Adhoc         EC         14   15000
4    mohan  Contract         CS          9   10000
5   pramod   Regular         EC          8   40000

In [20]:
regular=df[df['Type']=='Regular']
regular

     Ename     Type Department  Experienc  Salary
0   roshan  Regular         CS         10   50000
2  ashwini  Regular         EC          4   30000
5   pramod  Regular         EC          8   40000

In [21]:
Regular=regular['Salary'].mean()
Regular

np.float64(40000.0)

In [22]:
count=df['Type'].value_counts()
count

Type
Regular     3
Adhoc       2
Contract    1
Name: count, dtype: int64